glocklueng/032/LayerOne_2014/badge/stm32-prox/rev4/stm32f34-charliex-lost-his-mind/stm32f4-proxmark3/armsrc/fpgaloader.c
			while ( FpgaImageLen-->0 ) {
				DownloadFPGA_byte ( FpgaImage[ ( i++ ) ^0x3] );
			}

			/* Explanation of the magic in the above line:
			 * i^0x3 inverts the lower two bits of the integer i, counting backwards
			 * for each 4 byte increment. The generated sequence of (i++)^3 is
			 * 3 2 1 0 7 6 5 4 11 10 9 8 15 14 13 12 etc. pp.
			 */
		}
	}

	else {
		while ( FpgaImageLen-->0 ) {
			DownloadFPGA_byte ( *FpgaImage++ );
		}
	}

	// continue to clock FPGA until ready signal goes high
	i=100000;

	while ( ( i-- ) && ( ! ( AT91C_BASE_PIOA->PIO_PDSR & GPIO_FPGA_DONE ) ) ) {
		HIGH ( GPIO_FPGA_CCLK );
		LOW ( GPIO_FPGA_CCLK );
	}

	// crude error indicator, leave both red LEDs on and return
	if ( i==0 ) {
		LED_C_ON();
		LED_D_ON();
		return;
	}

	LED_D_OFF();
}

static char *bitparse_headers_start;
static char *bitparse_bitstream_end;
static int bitparse_initialized;
/* Simple Xilinx .bit parser. The file starts with the fixed opaque byte sequence
 * 00 09 0f f0 0f f0 0f f0 0f f0 00 00 01
 * After that the format is 1 byte section type (ASCII character), 2 byte length
 * (big endian), <length> bytes content. Except for section 'e' which has 4 bytes
 * length.
 */
static const char _bitparse_fixed_header[] = {0x00, 0x09, 0x0f, 0xf0, 0x0f, 0xf0, 0x0f, 0xf0, 0x0f, 0xf0, 0x00, 0x00, 0x01};
static int bitparse_init ( void * start_address, void *end_address )
{
	bitparse_initialized = 0;

	if ( memcmp ( _bitparse_fixed_header, start_address, sizeof ( _bitparse_fixed_header ) ) != 0 ) {
		return 0; /* Not matched */
	}

	else {
		bitparse_headers_start= ( ( char* ) start_address ) + sizeof ( _bitparse_fixed_header );
		bitparse_bitstream_end= ( char* ) end_address;
		bitparse_initialized = 1;
		return 1;
	}
}

int bitparse_find_section ( char section_name, char **section_start, unsigned int *section_length )
{
	char *pos = bitparse_headers_start;
	int result = 0;

	if ( !bitparse_initialized ) {
		return 0;
	}

	while ( pos < bitparse_bitstream_end ) {
		char current_name = *pos++;
		unsigned int current_length = 0;

		if ( current_name < 'a' || current_name > 'e' ) {
			/* Strange section name, abort */
			break;
		}

		current_length = 0;

		switch ( current_name ) {
			case 'e':
				/* Four byte length field */
				current_length += ( *pos++ ) << 24;
				current_length += ( *pos++ ) << 16;

			default: /* Fall through, two byte length field */
				current_length += ( *pos++ ) << 8;
				current_length += ( *pos++ ) << 0;
		}

		if ( current_name != 'e' && current_length > 255 ) {
			/* Maybe a parse error */
			break;
		}

		if ( current_name == section_name ) {
			/* Found it */
			*section_start = pos;
			*section_length = current_length;
			result = 1;
			break;
		}

		pos += current_length; /* Skip section */
	}

	return result;
}

//-----------------------------------------------------------------------------
// Find out which FPGA image format is stored in flash, then call DownloadFPGA
// with the right parameters to download the image
//-----------------------------------------------------------------------------

static const char *_binary_fpga_bit_end=_binary_fpga_bit_start+sizeof ( _binary_fpga_bit_start );

void FpgaDownloadAndGo ( void )
{
	/* Check for the new flash image format: Should have the .bit file at &_binary_fpga_bit_start
	 */
	if ( bitparse_init ( ( void* ) &_binary_fpga_bit_start, ( void* ) _binary_fpga_bit_end ) ) {
		/* Successfully initialized the .bit parser. Find the 'e' section and
		 * send its contents to the FPGA.
		 */
		char *bitstream_start;
		unsigned int bitstream_length;

		if ( bitparse_find_section ( 'e', &bitstream_start, &bitstream_length ) ) {
			DownloadFPGA ( bitstream_start, bitstream_length, 0 );

			return; /* All done */
		}
	}

	/* Fallback for the old flash image format: Check for the magic marker 0xFFFFFFFF
	 * 0xAA995566 at address 0x102000. This is raw bitstream with a size of 336,768 bits
	 * = 10,524 DWORDs, stored as DWORDS e.g. little-endian in memory, but each DWORD
	 * is still to be transmitted in MSBit first order. Set the invert flag to indicate
	 * that the DownloadFPGA function should invert every 4 byte sequence when doing
	 * the bytewise download.
	 */
	if ( * ( uint32_t* ) 0x102000 == 0xFFFFFFFF && * ( uint32_t* ) 0x102004 == 0xAA995566 ) {
		DownloadFPGA ( ( char* ) 0x102000, 10524*4, 1 );
	}
}

void FpgaGatherVersion ( char *dst, int len )
{
	char *fpga_info;
	unsigned int fpga_info_len;
	dst[0] = 0;

	if ( !bitparse_find_section ( 'e', &fpga_info, &fpga_info_len ) ) {
		strncat ( dst, "FPGA image: legacy image without version information", len-1 );
	}

	else {
		strncat ( dst, "FPGA image built", len-1 );
		/* USB packets only have 48 bytes data payload, so be terse */
#if 0

		if ( bitparse_find_section ( 'a', &fpga_info, &fpga_info_len ) && fpga_info[fpga_info_len-1] == 0 ) {
			strncat ( dst, " from ", len-1 );
			strncat ( dst, fpga_info, len-1 );
		}

		if ( bitparse_find_section ( 'b', &fpga_info, &fpga_info_len ) && fpga_info[fpga_info_len-1] == 0 ) {
			strncat ( dst, " for ", len-1 );
			strncat ( dst, fpga_info, len-1 );
		}

#endif

		if ( bitparse_find_section ( 'c', &fpga_info, &fpga_info_len ) && fpga_info[fpga_info_len-1] == 0 ) {
			strncat ( dst, " on ", len-1 );
			strncat ( dst, fpga_info, len-1 );
		}

		if ( bitparse_find_section ( 'd', &fpga_info, &fpga_info_len ) && fpga_info[fpga_info_len-1] == 0 ) {
			strncat ( dst, " at ", len-1 );
			strncat ( dst, fpga_info, len-1 );
		}
	}
}

//-----------------------------------------------------------------------------
// Send a 16 bit command/data pair to the FPGA.
// The bit format is:  C3 C2 C1 C0 D11 D10 D9 D8 D7 D6 D5 D4 D3 D2 D1 D0
// where C is the 4 bit command and D is the 12 bit data
//-----------------------------------------------------------------------------
void FpgaSendCommand ( WORD cmd, WORD v )
{
	SetupSpi ( SPI_FPGA_MODE );

	while ( ( AT91C_BASE_SPI->SPI_SR & AT91C_SPI_TXEMPTY ) == 0 );  // wait for the transfer to complete

	AT91C_BASE_SPI->SPI_TDR = AT91C_SPI_LASTXFER | cmd | v;     // send the data
}
//-----------------------------------------------------------------------------
// Write the FPGA setup word (that determines what mode the logic is in, read
// vs. clone vs. etc.). This is now a special case of FpgaSendCommand() to
// avoid changing this function's occurence everywhere in the source code.
//-----------------------------------------------------------------------------
void FpgaWriteConfWord ( BYTE v )
{
	FpgaSendCommand ( FPGA_CMD_SET_CONFREG, v );
}

#endif

