glocklueng/032/LayerOne_2014/badge/stm32-prox/rev4/stm32f34-charliex-lost-his-mind/stm32f4-proxmark3/armsrc/fpgaloader.c
#include "stm32f4xx.h"

#include "hw_config.h"
#include "l1_board.h"

#include "proxmark3.h"
#include "integer.h"
#include "apps.h"
#include "util.h"
#include "string.h"

#include "stm32f4xx_dma.h"

DMA_Stream_TypeDef FPGA_DMA;

// for bitbanging the bitstream
#define FPGA_SCLK_HIGH()        HIGH(GPIO_SSC_CLK)
#define FPGA_SCLK_LOW()             LOW(GPIO_SSC_CLK)
#define FPGA_SDIN_HIGH()        HIGH(GPIO_SSC_DIN)
#define FPGA_SDIN_LOW()         LOW(GPIO_SSC_DIN)

// fpga <> arm comms
#define FPGA_NCS_LOW()          LOW(NCS)
#define FPGA_NCS_HIGH()         HIGH(NCS)
#define FPGA_MOSI_LOW()         LOW(MOSI)
#define FPGA_MOSI_HIGH()        HIGH(MOSI)
#define FPGA_SPCK_LOW()         LOW(SPCK)
#define FPGA_SPCK_HIGH()        HIGH(SPCK)

// Temporarily putting my SPI routines in here til they work.


#define __no_operation(void)        asm("nop")

/**
 * softspi_rxtx(data) - send and receive a byte on a software SPI
 *
 * @param data - 8 bits to send
 *
 * @return 8 bits read back
*/
unsigned char softspi_rxtx ( unsigned char data )
{
	unsigned char ret;
	unsigned char bitmask;

	LOW ( SPI_CLK  );

	LOW ( SPI_CS ) ;

	// delay
	__no_operation();

	bitmask = 0x80;
	ret = 0;

	do  {

		LOW ( SPI_OUT );

		if ( data & bitmask ) {
			HIGH ( SPI_OUT );
		}

		HIGH ( SPI_CLK );

		if ( GETBIT ( SPI_IN ) ) {
			ret |= bitmask;
		}

		// delay
		__no_operation();

		LOW ( SPI_CLK  );
		bitmask = bitmask >> 1;

		__no_operation();

	}
	while ( bitmask != 0 );


	// delay
	__no_operation();
	__no_operation();

	HIGH ( SPI_CS );

	return ret;
}
/*
    __~

*/


uint16_t softspi_rx ( void )
{
	register uint16_t ret;
	
	//return ssp_byte;
  
	/* Wait for SPIz data reception */
	while ( SPI_I2S_GetFlagStatus ( SPI2, SPI_I2S_FLAG_RXNE ) == RESET );

	/* Read SPIz received data */
	ret= SPI_I2S_ReceiveData ( SPI2 );

	return ret;
	
	register unsigned char bitmask ;

	bitmask = 0x80;

	ret = 0;

	// Frame _||_____

	// if you enter and frame is high, wait til it goes low.
	if ( GETBIT ( SSP_FRAME  ) == 1  ) {

		//wait til it goes low
		while ( GETBIT ( SSP_FRAME  ) == 1 );
	}


	// wait while frame is low (rising edge)
	while ( GETBIT ( SSP_FRAME  ) == 0 );


	// unrolled is faster...

	//#1

	// 300ns
	// wait while ssp clk is high
	while ( GETBIT ( SPI_CLK  )  == 1 );

	// now ssp_clk is low. read ssp_din
	if ( GETBIT ( SPI_IN ) ) {
		ret |=0x80;
	}

	//while active low, wait
	while ( GETBIT ( SPI_CLK  )  == 0 );


	// adc_clk should be as rising edge

	//#2
	// wait til adc_clk goes to 0, active low
	while ( GETBIT ( SPI_CLK  )  == 1 );

	if ( GETBIT ( SPI_IN ) ) {
		ret |= 0x40;
	}

	//while active low, wait
	while ( GETBIT ( SPI_CLK  )  == 0 );

	//#3
	while ( GETBIT ( SPI_CLK  )  == 1 );

	if ( GETBIT ( SPI_IN ) ) {
		ret |=0x20;
	}

	while ( GETBIT ( SPI_CLK  )  == 0 );

	//#4
	while ( GETBIT ( SPI_CLK  )  == 1 );

	if ( GETBIT ( SPI_IN ) ) {
		ret |=0x10;
	}

	while ( GETBIT ( SPI_CLK  )  == 0 );

	//#4
	while ( GETBIT ( SPI_CLK  )  == 1 );

	if ( GETBIT ( SPI_IN ) ) {
		ret |=0x8;
	}

	while ( GETBIT ( SPI_CLK  )  == 0 );

	//#6
	while ( GETBIT ( SPI_CLK  )  == 1 );

	if ( GETBIT ( SPI_IN ) ) {
		ret |=0x4;
	}

	while ( GETBIT ( SPI_CLK  )  == 0 );

	//#7
	while ( GETBIT ( SPI_CLK  )  == 1 );

	if ( GETBIT ( SPI_IN ) ) {
		ret |=0x2;
	}

	while ( GETBIT ( SPI_CLK  )  == 0 );

	//#8
	while ( GETBIT ( SPI_CLK  )  == 1 );

	if ( GETBIT ( SPI_IN ) ) {
		ret |=0x1;
	}

	/*
	if( ret != 0xaa ) {

	  HIGH(NVDD_ON);
	asm("nop");
	asm("nop");
	asm("nop");
	  LOW(NVDD_ON);
	asm("nop");
	asm("nop");
	asm("nop");
	}
	*/

	return ret;
}

static void FPGASpiInit ( void )
{
	FPGA_SDIN_HIGH() ;
	FPGA_SCLK_HIGH();

	DelayuS ( 50 );
}

static void FPGASpiSendByte ( unsigned char data )
{
	unsigned char  i ;
	unsigned char  tbyte = data ;

	FPGA_SCLK_HIGH( );

	__no_operation();

	for ( i = 0 ; i < 8 ; i++ ) {

		if ( tbyte & 0x80 ) {
			FPGA_SDIN_HIGH() ;
		}

		else {
			FPGA_SDIN_LOW() ;
		}

		__no_operation();
		FPGA_SCLK_LOW() ;

		__no_operation();
		FPGA_SCLK_HIGH( );

		tbyte  <<= 1;
	}
}

//
// NCS~~~~__________~~~
// CLK...._~_~_~_~_~....
// MOSI..____~___~__....
//

// NCS Is active low before we get here.
void FPGASpiSendWord ( register unsigned short cmdword )
{
	unsigned short  i ;

	FPGA_SPCK_HIGH( );

	for ( i = 0 ; i <  16 ; i++ ) {

		if ( cmdword & ( unsigned short ) 0x8000 ) {
			FPGA_MOSI_HIGH() ;
		}

		else {
			FPGA_MOSI_LOW() ;
		}

		// Toggle SoftSPI CLK
		FPGA_SPCK_LOW() ;
		FPGA_SPCK_HIGH( );

		cmdword  <<= 1;
	}
}

//-----------------------------------------------------------------------------
// Send a 16 bit command/data pair to the FPGA.
// The bit format is:  C3 C2 C1 C0 D11 D10 D9 D8 D7 D6 D5 D4 D3 D2 D1 D0
// where C is the 4 bit command and D is the 12 bit data
//-----------------------------------------------------------------------------
void FpgaSendCommand ( WORD cmd, WORD v )
{
	// SetupSpi(SPI_FPGA_MODE);
	FPGASpiSendWord ( cmd | v );

	// no done on Software SPI
}

//-----------------------------------------------------------------------------
// Write the FPGA setup word (that determines what mode the logic is in, read
// vs. clone vs. etc.). This is now a special case of FpgaSendCommand() to
// avoid changing this function's occurence everywhere in the source code.
//-----------------------------------------------------------------------------
void FpgaWriteConfWord ( uint8_t v )
{
	FPGA_NCS_LOW();

	FpgaSendCommand ( FPGA_CMD_SET_CONFREG, v );

	FPGA_NCS_HIGH();
	FPGA_NCS_LOW();
}

//-----------------------------------------------------------------------------
// Set up the CMOS switches that mux the ADC: four switches, independently
// closable, but should only close one at a time. Not an FPGA thing, but
// the samples from the ADC always flow through the FPGA.
//-----------------------------------------------------------------------------
void _SetAdcMuxFor ( GPIO_TypeDef *port, u16 pin )
{
	LOW ( GPIO_MUXSEL_HIPKD );
	LOW ( GPIO_MUXSEL_HIRAW );
	LOW ( GPIO_MUXSEL_LORAW );
	LOW ( GPIO_MUXSEL_LOPKD );

	GPIO_WriteBit ( port,pin,Bit_SET );
}

static void DownloadFPGA_byte ( unsigned char w )
{
#define SEND_BIT(x) { ;if(w & (1<<x) ) HIGH(GPIO_FPGA_DIN); else LOW(GPIO_FPGA_DIN); HIGH(GPIO_FPGA_CCLK); LOW(GPIO_FPGA_CCLK); }

	SEND_BIT ( 7 );
	SEND_BIT ( 6 );
	SEND_BIT ( 5 );
	SEND_BIT ( 4 );
	SEND_BIT ( 3 );
	SEND_BIT ( 2 );
	SEND_BIT ( 1 );
	SEND_BIT ( 0 );

