glocklueng/032/LayerOne_2014/badge/stm32-prox/rev4/stm32f34-charliex-lost-his-mind/stm32f4-proxmark3/armsrc/fpgaloader.c
//-----------------------------------------------------------------------------
// Set up the synchronous serial port, with the one set of options that we
// always use when we are talking to the FPGA. Both RX and TX are enabled.
//-----------------------------------------------------------------------------
void FpgaSetupSsc ( unsigned char on_off )
{
#if BOARD_REVISION == 3

	SPI_InitTypeDef  SPI_InitStructure;
  	GPIO_InitTypeDef GPIO_InitStructure;
	
	if ( on_off ) {
	  
		/*-----------------ARKO'S TEST CODE - SPI SLAVE-----------------------------*/
	
	 	 // Start SPI Slave
	
		/* Enable SPI2 Periph clock */
		RCC_APB1PeriphClockCmd( RCC_APB1Periph_SPI2, ENABLE );
    		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB | RCC_AHB1Periph_GPIOC, ENABLE);
		
		// Inputs
		// SPI SSP_NSS - PB12, SSP_CLK=PB13, SSP_MOSI = PB15
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
		GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
		GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_15;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
	
		// Outputs
		// SSP_MISO = PB14
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
		GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
		GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
		
		// Setup as Alternative function
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource12, GPIO_AF_SPI2);	// SSP_NSS
  		GPIO_PinAFConfig(GPIOB, GPIO_PinSource13, GPIO_AF_SPI2);	// SSP_CLK
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource14, GPIO_AF_SPI2);	// SP_MOSI
  		GPIO_PinAFConfig(GPIOB, GPIO_PinSource15, GPIO_AF_SPI2);	// SP_MISO
  
		SPI_InitStructure.SPI_Direction = SPI_Direction_1Line_Rx;
		SPI_InitStructure.SPI_Mode = SPI_Mode_Slave;
		SPI_InitStructure.SPI_DataSize = SPI_DataSize_16b;
		SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;   // high
		SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;  // 1edge // Sample on clock falling edge
		SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
		SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
		SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
		SPI_InitStructure.SPI_CRCPolynomial = 15;
		SPI_Init ( SPI2, &SPI_InitStructure );

		/* Enable SPIz */
		SPI_Cmd ( SPI2, ENABLE );
	}

	return;

#else
#endif

}

void FpgaDisableSscDma ( void )
{
  	/* Enable DMA */
	DMA_Cmd ( DMA1_Stream3, DISABLE );

	SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx , DISABLE);

}

void FpgaEnableSscDma ( void )
{
  	/* Enable DMA */
	DMA_Cmd ( DMA1_Stream3, ENABLE );

	SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx , ENABLE);

}

//-----------------------------------------------------------------------------
// Set up DMA to receive samples from the FPGA. We will use the PDC, with
// a single buffer as a circular buffer (so that we just chain back to
// ourselves, not to another buffer). The stuff to manipulate those buffers
// is in apps.h, because it should be inlined, for speed.
//-----------------------------------------------------------------------------
bool FpgaSetupSscDma ( uint8_t *buf, int len )
{
	DMA_InitTypeDef DMA_InitStructure;
	NVIC_InitTypeDef    NVIC_InitStructure;
	
	//DMA setup
	
	DMA_StructInit ( &DMA_InitStructure );
	
	// Enable DMA clock
	RCC_AHB1PeriphClockCmd ( RCC_AHB1Periph_DMA1, ENABLE );
	
	/* DMA configuration */
	
	//channel 0, stream 3, rx, channel 0, stream 4, tx
	DMA_DeInit ( DMA1_Stream3 );
	
	DMA_ClearFlag(DMA1_Stream3, DMA_FLAG_TCIF3);	//transfer complete
  	DMA_ClearFlag(DMA1_Stream3, DMA_FLAG_TEIF3); 
  	DMA_ClearFlag(DMA1_Stream3, DMA_FLAG_FEIF3); 
  	DMA_ClearFlag(DMA1_Stream3, DMA_FLAG_DMEIF3);
	
	DMA_Cmd(DMA1_Stream3, DISABLE);	

	DMA_StructInit( &DMA_InitStructure );
	DMA_InitStructure.DMA_Channel  = DMA_Channel_0;				//SPI2_RX
	DMA_InitStructure.DMA_PeripheralBaseAddr =  ( uint32_t ) &SPI2->DR;
	DMA_InitStructure.DMA_Memory0BaseAddr = ( uint32_t ) buf;
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;	// from device to cpu
	DMA_InitStructure.DMA_BufferSize = len;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	
	// a word is 32 bits... halfword 16 bit....
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
	
	DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
	DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
	
	DMA_InitStructure.DMA_FIFOMode  = DMA_FIFOMode_Disable;           //Operate in FIFO mode
	
	DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
	DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;  

//	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
	DMA_Init ( DMA1_Stream3, &DMA_InitStructure );

	/* Enable DMA Transfer Complete interrupt */
	DMA_ITConfig ( DMA1_Stream3, DMA_IT_HT | DMA_IT_TC, ENABLE );

	return true;
}


// DMA buffer

uint8_t fpga_dma_buffer[];
#if 0
uint16_t TxIdx = 0;
uint16_t RxIdx = 0;
uint16_t SPIz_Buffer_Tx[BufferSize] = {0xFFFF};

static uint16_t SPIy_Buffer_Rx[BufferSize], SPIz_Buffer_Rx[BufferSize];

while ( GETBIT ( SSP_FRAME  ) == 0 );

/* Transfer procedure */
while ( RxIdx < BufferSize )
{
	/* Wait for SPIz data reception */
	while ( SPI_I2S_GetFlagStatus ( SPI2, SPI_I2S_FLAG_RXNE ) == RESET );

	/* Read SPIz received data */
	SPIz_Buffer_Rx[RxIdx] = SPI_I2S_ReceiveData ( SPI2 );
	RxIdx++;
}

/*-------------- END ARKO'S TEST CODE - SPI SLAVE---------------------------*/

#endif
